let amount = {
  "MacBookAir11.6英寸笔记本": 1,
  "Beats录音师蓝牙无线版耳机": 1,
  "iPadAir9.7英寸平板银16G": 1,
  "700 bike": 1,
  "飞利浦智能扫地机器人": 3,
  "Nike SportWatch智能手表": 2,
  "飞利浦蓝牙音箱": 3,
  "漫步者新一代电视/客厅音响": 2,
  "富士拍立得": 3,
  "防滴溅运动式MP3 索尼": 5,
  "Kindle 6英寸": 6,
  "小霸王智能电视体感游戏机": 4,
  "樱桃机械键盘": 2,
  "米乔人体工程学鼠标": 3,
  "博朗额温计": 2,
  "美的快热炉取暖器": 2,
  "索尼入耳式耳机": 5,
  "漫步者无线蓝牙运动耳机": 5,
  "飞利浦电动剃须刀": 5,
  "手机镜头": 5,
  "舒客声波电动牙刷": 3,
  "100元购物卡": 135
}

let users = [
  "陈莉萍", "姜懿洋", "李荣俊", "李泽隆", "梁嘉荣", "苏俊屹", "王旭", "王意", "韦小松", "杨黛",
  "余伯韬", "陈建逢", "黄坚毅", "邝新荣", "李小龙", "林煌", "石有滴", "覃世安", "温日生", "吴成进", 
  "吴维羽", "余镇源", "杨继臣", "朱铮宇", "王欢欢", "肖瑶瑶", "梁倩钰", "柳玲", "陈勇华", "董亮", 
  "黄全", "黄贤钹", "黄展鹏", "江志", "李奕挺", "刘杰彬", "刘伟", "刘耀华", "丘小营", "苏乃文", 
  "王广贤", "吴佳鑫", "谢俊滔", "杨再仲", "余程", "余浩明", "郑浩锋", "周子贻", "梁超", "黄慧杰", 
  "雷运", "朱欣欣", "庄妍", "曹瑜", "韩融", "胥佳明", "袁雅", "吴剑宇", "陈舒惠", "顾家薇", 
  "何钦龙", "李丹", "王鹏", "王雅雯", "谢靓伟", "杨柳青", "朱玲玲", "刘晓晖", "梁珊", "罗骁", 
  "温斐然", "吴穗南", "王航", "程煜雯", "陈秀冰", "李珺", "任娟", "谭宝君", "王娜", "王晓文", 
  "王玉琴", "杨美欣", "胡冰川", "李倩文", "何苑瑕", "刘艳", "吴沁雯", "朱丽贤", "邓伟俊", "何嘉俊", 
  "胡步军", "黄子泽", "蓝小敏", "林志雄", "罗婉文", "罗鹰", "韦智深", "温天宇", "袁凯", "周建", 
  "蔡韵琪", "曾琳", "方雯榆", "高怡婷", "黄健文", "李秋兰", "李烁", "林桂荣", "卢嘉麟", "骆广谦", 
  "麻小雷", "毛佳佳", "莫杰勇", "王凯程", "谢芃芃", "张翔", "赵谦", "钟舒萍", "邹圆婧", "方楚娴", 
  "罗晓育", "邓梦诗", "杜婷怡", "李小凤", "刘晓慧", "涂倩倩", "张梦婷", "邹淑贞", "冯淑清", "黄蕾", 
  "邓茵尹", "毛佳茹", "陈耀斌", "李燕冰", "许梦涵", "黄琳曼", "杜淑珩", "孔祥焕", "廖多依", "罗小敷",
  "谢霞玲", "黄嘉婵", "周志威", "蔡惠纯", "蔡晓帆", "陈晓媛", "储琤琤", "单荦", "赖晓欣", "刘琛", 
  "余瑶", "陈坚", "李颖琳", "付琦", "光英英", "黎禧健", "刘腾", "余泽杭", "朱家棣", "赖俊雄", 
  "朱睿", "陈少杰", "李于根", "梁宗东", "林剑辉", "招啟汛", "钟安祺", "邝杰洪", "孙三威", "覃健", 
  "杨颖莹", "李道礼", "马朋飞", "沈俊聪", "魏敦晓", "徐程伟", "宋子跃", "张瑞", "张文慈", "符文静", 
  "胡威", "曹星冉", "郭鹏超", "李晶", "闾欣怡", "夏琳", "陈斯媛", "李照楠", "林舒扬", "饶玮", 
  "肖树山", "严汕汕", "易越", "陈静", "黄永佳", "陈沛新", "谢美琪", "梁诗韵", "李垚"
]

let gifts = []
for (let k in amount) {
  for (let i = 0; i < amount[k]; i++) {
    gifts.push(k)
  }
}

function randomArr(array) {
    let m = array.length, t, i
    while (m) {
      i = Math.floor(Math.random() * m--)
      t = array[m]
      array[m] = array[i]
      array[i] = t
    }
    return array;
}

gifts = randomArr(gifts)
users = randomArr(users)

module.exports = {
  gifts: gifts,
  users: users,
  allgifts: gifts,
  allusers: users,
  tmpUsers: [],
  tmpGifts: [],
  round: 0,
  roundAll: 2,
  amount: amount,
  res: [],
  total: users.length
}


